# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailCurveArray..::..Append Method
DetailCurveArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	DetailCurve item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As DetailCurve _
)
```

Visual C++
---
```text
public:
virtual void Append(
	DetailCurve^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..DetailCurve
# See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace